cmsis-svd/cmsis-svd/data/NXP/LPC111x.svd
  					</field>
  					<field>
  						<name>WDINT</name>
  						<description>Watchdog interrupt flag. Set when the timer reaches the value in WDWARNINT. Cleared by software.</description>
  						<bitRange>[3:3]</bitRange>
  						
  					</field>
  					<field>
  						<name>WDPROTECT</name>
  						<description>Watchdog update mode. This bit is Set Only.</description>
  						<bitRange>[4:4]</bitRange>
  						<enumeratedValues>
  							<name>ENUM</name>
  							<enumeratedValue>
  								<name>ANYTIME</name>
  								<description>The watchdog reload value (WDTC) can be changed at any time.</description>
  								<value>0</value>
  							</enumeratedValue>
  							<enumeratedValue>
  								<name>LOWCOUNTER</name>
  								<description>The watchdog reload value (WDTC) can be changed only after the counter is below the value of WDWARNINT and WDWINDOW. Note: this mode is intended for use only when WDRESET =1.</description>
  								<value>1</value>
  							</enumeratedValue>
  						</enumeratedValues>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:5]</bitRange>
  						
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDTC</name>
  				<description>Watchdog timer constant register. This register determines the time-out value.</description>
  				<addressOffset>0x004</addressOffset>
  				<access>read-write</access>
  				<resetValue>0xFF</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>Count</name>
  						<description>Watchdog time-out interval.</description>
  						<bitRange>[23:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:24]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDFEED</name>
  				<description>Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in WDTC.</description>
  				<addressOffset>0x008</addressOffset>
  				<access>write-only</access>
  				<resetValue>0</resetValue>
  				<resetMask>0x00000000</resetMask>
  				<fields>
  					<field>
  						<name>Feed</name>
  						<description>Feed value should be 0xAA followed by 0x55.</description>
  						<bitRange>[7:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved</description>
  						<bitRange>[31:8]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDTV</name>
  				<description>Watchdog timer value register. This register reads out the current value of the Watchdog timer.</description>
  				<addressOffset>0x00C</addressOffset>
  				<access>read-only</access>
  				<resetValue>0xFF</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>Count</name>
  						<description>Counter timer value.</description>
  						<bitRange>[23:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:24]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDWARNINT</name>
  				<description>Watchdog Warning Interrupt compare value.</description>
  				<addressOffset>0x014</addressOffset>
  				<access>read-write</access>
  				<resetValue>0</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>WARNINT</name>
  						<description>Watchdog warning interrupt compare value.</description>
  						<bitRange>[9:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:10]</bitRange>
  					</field>
  				</fields>
  			</register>
  			<register>
  				<name>WDWINDOW</name>
  				<description>Watchdog Window compare value.</description>
  				<addressOffset>0x018</addressOffset>
  				<access>read-write</access>
  				<resetValue>0xFFFFFF</resetValue>
  				<resetMask>0xFFFFFFFF</resetMask>
  				<fields>
  					<field>
  						<name>WINDOW</name>
  						<description>Watchdog window value.</description>
  						<bitRange>[23:0]</bitRange>
  					</field>
  					<field>
  						<name>RESERVED</name>
  						<description>Reserved. Read value is undefined, only zero should be written.</description>
  						<bitRange>[31:24]</bitRange>
  					</field>
  				</fields>
  			</register>
  		</registers>
  	</peripheral>
<peripheral>
	<name>UART</name>
	<description>UART</description>
	<groupName>UART</groupName>
	<baseAddress>0x40008000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>UART</name>
	<value>21</value>
	</interrupt>
	<registers>
		<register>
			<name>RBR</name>
			<description>Receiver Buffer Register. Contains the next received character to be read. (DLAB=0)</description>
			<addressOffset>0x000</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<readAction>modify</readAction>
			<fields>
				<field>
					<name>RBR</name>
					<description>The UART Receiver Buffer Register contains the oldest received byte in the UART RX FIFO.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>THR</name>
			<description>Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0)</description>
			<alternateRegister>RBR</alternateRegister>			
			<addressOffset>0x000</addressOffset>
		
